//RUNSUMUP JOB (ACCT),'RUN SUMUP',CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//*
//* Run SUMUP and GREET from the library USER1.SUMUP.LOAD
//*
//SUMUP    EXEC PGM=SUMUP,PARM='10 20 30'
//STEPLIB  DD DSN=USER1.SUMUP.LOAD,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSTERM  DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//*
//GREET    EXEC PGM=GREET
//STEPLIB  DD DSN=USER1.SUMUP.LOAD,DISP=SHR
