//RECEIVE  JOB (ACCT),'RECEIVE SUMUP',CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//*
//* Receive USER1.SUMUP.XMIT into the new library USER1.SUMUP.LOAD
//*
//RECV     EXEC PGM=IKJEFT01,REGION=4096K
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
 RECEIVE INDSN('USER1.SUMUP.XMIT') -
  DATASET('USER1.SUMUP.LOAD')
/*
