//RECV370  JOB (ACCT),'RECV370 SUMUP',CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//*
//* Receive USER1.SUMUP.XMIT into the new library USER1.SUMUP.LOAD
//* with the batch program RECV370
//*
//RECV     EXEC PGM=RECV370,REGION=4096K
//RECVLOG  DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
//XMITIN   DD DSN=USER1.SUMUP.XMIT,DISP=SHR
//SYSUT1   DD UNIT=VIO,SPACE=(CYL,(5,1)),DISP=(NEW,DELETE)
//SYSUT2   DD DSN=USER1.SUMUP.LOAD,DISP=(,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(1,1,20),RLSE)
